window['FLS'] = false;

// Подключение основного файла стилей
import "../scss/style.scss";
// Плагины ============================================================================================================================================================================================================================================================================================================

/* Динамический адаптив */
import "./libs/dynamic_adapt.js";

// Основные модули ========================================================================================================================================================================================================================================================
import * as customFunctions from "./files/functions.js";

/* Проверка поддержки webp, добавление класса webp или no-webp для HTML */
/* (i) необходимо для корректного отображения webp из css  */
// customFunctions.isWebp();

/*
Модуль работы со спойлерами
Документация:
Сниппет (HTML): spollers
*/
customFunctions.spollers();

/*
Модуль работы с табами
Документация:
Сниппет (HTML): tabs
*/
customFunctions.tabs();


/*
Попапы
Документация по работе в шаблоне:
Сниппет (HTML): pl
*/
customFunctions.initPopups();



// Работа с формами ========================================================================================================================================================================================================================================================
import * as flsForms from "./files/forms/forms.js";

/* Модуль работы с select.  */
flsForms.formSelect();

/*
Настройка подключения плагина слайдера Swiper и новых слайдеров выполняется в файле js/files/sliders.js
Документация по работе в шаблоне:
Документация плагина: https://swiperjs.com/
Сниппет(HTML): swiper
*/
import "./files/sliders.js";

/*
Ленивая (отложенная) загрузка картинок
Документация по работе в шаблоне: В HTML добавляем img, video, audio, iframe но вместо src пишем data-src
Документация плагина: https://github.com/verlok/vanilla-lazyload
Сниппет(HTML):
*/
import './files/scroll/lazyload.js';

// Галерея ========================================================================================================================================================================================================================================================
/*
Документация по работе в шаблоне: https://www.lightgalleryjs.com/docs/
Документация плагина: https://www.lightgalleryjs.com/docs/
Сниппет(HTML):
*/
import "./files/gallery.js";

// Прочее ========================================================================================================================================================================================================================================================
/* Подключаем файлы со своим кодом */
import "./files/script.js";
//============================================================================================================================================================================================================================================