// Подключение функционала "Чертогов Фрилансера"
// Вспомогательные функции
import { isMobile, _slideUp, _slideDown, _slideToggle } from "../functions.js";
// Класс select
import { SelectConstructor } from "../../libs/select.js";
// Класс масок
//==============================================================================================================================================================================================================================================================================================================================
// Объект модулей форм для экспорта
export const formsModules = {
	selectModule: null
}
//================================================================================================================================================================================================================================================================================================================================

/* Модуль работы с select */
export function formSelect() {
	formsModules.selectModule = new SelectConstructor({});
}